<UNK>
<START>
<END>
<NEWLINE>
*
=
{
if
}
the
*/
/*
struct
return
int
to
static
is
void
a
0;
of
for
and
unsigned
long
-
in
#include
==
we
be
that
&&
goto
it
this
ret
else
&
on
<
!=
char
not
+
case
#endif
||
are
with
This
The
ret;
#ifdef
const
break;
from
by
task_struct
If
1;
/**
return;
or
#define
NULL;
can
inline
will
0)
};
as
task
function
have
>
an
all
while
\
},
We
|
0,
which
bool
+=
0
-EINVAL;
do
CPU
has
u64
when
flags);
set
so
only
out;
no
must
at
but
cpu
__user
new
err
any
file
"
i
extern
need
called
data
(i
should
buffer
time
>=
up
:
one
used
lock
0);
rq
error
?
event
current
before
then
continue;
i;
1
after
state
use
page
may
size_t
flags;
i++)
its
number
err;
into
timer
value
NULL,
|=
CTL_INT,
size
u32
module
-ENOMEM;
#else
enum
was
(ret)
there
1)
next
already
false;
__init
tasks
RCU
call
interrupt
don't
1);
/
<<
seq_file
check
kernel
list
other
1,
get
just
NULL);
true;
perf_event
memory
trace_array
code
first
idle
cpu);
GFP_KERNEL);
Copyright
(unsigned
out:
than
switch
more
been
user
thread
cgroup
cpu)
<=
loff_t
because
group
same
-EFAULT;
entry
(ret
ssize_t
out
make
update
work
pointer
might
free
process
system
(C)
grace
caller
start
list_head
bit
our
*,
sure
end
does
being
Returns
cpu,
irq
also
see
last
now
flags,
trace
want
still
-1;
count
read
NULL
It
device
type
period
A
each
rcu_read_unlock();
*p,
irq_desc
error;
wait
cpu;
they
here
result
it.
some
retval
resource
&=
load
program
context
either
since
2
you
under
without
flags
p
len
>>
seq_printf(m,
0644,
(void
rcu_node
events
write
inode
CPUs
returns
-=
until
functions
pages
interrupts
*p)
node
list)
CONFIG_SMP
it's
*m,
In
rcu_read_lock();
#
NULL)
.mode
about
running
GNU
General
run
done
(err)
Public
where
pid
name
See
.procname
even
could
can't
timespec
ktime_t
handler
allocate
delta
parent
another
tracer
disabled
change
default:
i,
pt_regs
cpuset
stop
.data
License
For
through
whether
address
needs
clock
.maxlen
.proc_handler
avoid
cpumask
ring
cfs_rq
structure
we're
between
ring_buffer
try
specified
signal
doesn't
*rq,
copy
string
ftrace_ops
kprobe
#if
cannot
always
mask
callbacks
using
(struct
would
mutex
*event)
given
trace_iterator
Check
register
*buf,
When
during
off
int,
rcu_head
callback
take
notifier
worker
never
back
two
old
active
them
add
cgroup_subsys_state
domain
#ifndef
pending
sizeof(struct
hash
filter
zero
*data)
head
",
length
both
rcu_state
Return
associated
flags)
stack
flag
target
Free
record
tracing
*buffer,
allow
test
Make
offset
us
such
wake
define
their
version
command
jiffies
handle
values
means
per
space
SEQ_printf(m,
were
held
len;
task_group
calls
critical
No
dentry
point
p,
notifier_block
size;
retval;
*inode,
Note
ensure
hold
*event,
mode
ip,
later
via
priority
.name
currently
{}
create
modify
#undef
these
default
keep
enabled
hrtimer
Called
%d\n",
*p;
find
waiting
local
trace_seq
ftrace_event_call
access
go
clock_event_device
full
too
");
count;
buffer,
*ppos)
path
sched_entity
'\0';
*)
addr
perf_event_context
allocated
longer
size,
out_unlock;
otherwise
(1
clocksource
state.
order
%
tick
trigger
chain
Set
array
counter
file_operations
delta;
release
remove
waiter
safe
-EPERM;
cred
ops
ftrace_event_file
.read
IRQ
Update
profiling
cpus
possible
rcu_data
disable
len,
So
%d
root
valid
Software
threads
.open
against
rt_mutex
owner
know
reset
p);
image
queue
work_struct
lock.
audit
local_irq_restore(flags);
cnt,
going
*info)
.llseek
support
gcov_info
key
CPU.
match
irq_data
move
following
single
-EBUSY;
irq,
passed
(error)
n
Do
sleep
field
reader
console
current;
time.
happen
But
different
clear
*file)
*file,
buffer.
returned
data;
task.
true
completion
locks
*lock)
lock,
holding
count,
reference
2;
bits
*lock,
type,
what
__weak
rt_rq
sched_domain
<linux/slab.h>
Must
*tr,
ring_buffer_event
<linux/sched.h>
atomic_t
0))
loop
All
gets
Only
wakeup
Don't
name,
write,
disabled.
line
online
read-side
.release
*rq)
__sched
nothing
terms
set,
level
true);
contains
false);
%s\n",
like
val
*tr)
(!ret)
2)
There
period.
entries
here.
*v)
context.
-ENODEV;
local_irq_save(flags);
s64
found
your
within
section
(0)
On
success,
timeout
ctl_table
ring_buffer_per_cpu
index
long)
based
own
-1)
request
addr,
acquire
runtime
least
t
map
race
global
message
base
<linux/module.h>
and/or
needed
second
every
css
queued
hardware
Return:
boot
child
due
syscall
*attr,
<linux/export.h>
__read_mostly
tree
put
available
above
specific
calling
(char
trace_seq_printf(s,
breakpoint
probe
actually
tmp
locking
*entry;
exit
prevent
guaranteed
barrier
setting
To
way
timers
previous
details.
uses
seq_puts(m,
preempt_enable();
(flags
%s
*name,
Ingo
(;;)
over
allowed
max
i);
Remove
j
&flags);
failed
print
val,
quiescent
mode,
empty
buf
restart
'
*pos)
mm_struct
audit_log_format(ab,
irqs
val;
variable
implementation
bytes
*regs)
workqueue
symbol
enable
again
published
multiple
kthread
registered
event,
list.
long,
control
*s,
left
*tr
*iter,
(len
*data,
)
buf,
there's
buffers
audit_context
futex
redistribute
pass
store
preempt_disable();
changed
*tsk)
pc);
something
those
--
block
blocked
care
yet
*str)
Inc.,
info
core
ftrace
*filp,
sizeof(int),
software;
printk(KERN_ERR
fields
held.
*p
*event;
ptr
interval
normal
part
works
suspend
state,
Since
descriptor
pool
*desc)
userspace
here,
cputime_t
-1
id
.func
worker_pool
instead
updated
fail
res
range
right
function.
down
tmp;
once
visible
1))
broadcast
object
kdb
many
subsystem
set.
internal
doing
real
true,
len);
*ops,
Initialize
uprobe
workqueue_struct
Molnar
Wait
force
argument
total
now,
nodes
Find
*buf)
let
*work)
woken
result;
pid,
irq_domain
<linux/init.h>
really
cause
smp_mb();
(cpu
information
stored
n;
task,
source
idx
*iter)
required
As
top
isn't
rc
signals
routine
out_unlock:
len)
print_line_t
added
seq_read,
0444,
user_namespace
*dev,
*rq
class
format
iterator
lock_list
existing
"PM:
cnt;
did
preemption
Use
pos
cpumask_var_t
*mod)
now;
.extra1
css_set
timekeeper
CTL_DIR,
You
corresponding
*arg)
list);
data,
pid_t
trace_entry
unlock;
ctx);
held_lock
f->op,
Now
unused
initialize
started
Add
size)
p)
released
32
success
inside
event);
files
kobject
proc_dointvec,
buffer_page
implied
code.
scheduler
directly
freed
allocation
created
skip
scheduling
RT
p;
"#
how
*ubuf,
value.
<linux/kernel.h>
Pointer
executing
These
jiffies;
start,
won't
up.
size);
cftype
allows
thus
Red
waiters
drop
regs);
Get
readers
writer
hotplug
lock_class
addr;
diag
*data;
changes
hierarchy
*tsk,
scheduled
interface
hlist_head
chip
bin_table
hope
false
debug
checks
matching
state)
Returns:
enough
itself
Try
.write
blocking
deadlock
sig,
table
log
destination
alarm
k_itimer
distributed
warranty
shared
defined
3
initial
action
arch
attached
trace_event
@cpu:
time,
credentials
pmu
*timer)
pwq
along
written
>>=
GFP_KERNEL,
swap
sets
away
got
...
for_each_possible_cpu(cpu)
output
removed
cache
smp_processor_id();
*mod,
parent_ip,
dependency
pool_workqueue
original
execution
Ensure
most
atomic
maximum
*task)
.flags
*task,
filter_pred
-1,
timer_list
irqaction
ftrace_hash
channel
useful,
lockdep
initialized
CPU,
prev
mask,
res;
snapshot
points
it,
taken
audit_buffer
Some
version.
WITHOUT
ANY
WARRANTY;
MERCHANTABILITY
FITNESS
FOR
PARTICULAR
not,
invoked
mark
necessary
below
"\n");
schedule();
handlers
I
rc;
generic
type)
->
*regs,
instruction
accounting
*desc,
Note:
PURPOSE.
special
otherwise.
*next;
offset;
leave
end;
times
*rsp,
trying
*q,
(or
.start
*desc
futex_q
<linux/interrupt.h>
early
*);
sizeof(unsigned
Allocate
sum
one.
groups
u8
actual
Otherwise
look
Hat,
*info,
simply
non
sched
addr)
latency
*table,
NUMA
rw_semaphore
seq
timespec64
takes
high
makes
printk(KERN_INFO
negative
happens
operations
softirq
head,
sequence
failure
hit
extra
i)
semaphore
holds
@buffer:
Foundation;
increment
offline
pid;
much
*curr,
them.
structure.
reason
migration
4
power
schedule
again.
send
(err
around
At
seq_lseek,
func,
*lenp,
capacity
uid
again;
*kobj,
(sample_type
(at
very
t;
Number
node,
n)
reserved
handling
CONFIG_HOTPLUG_CPU
whole
checking
Handle
*s
event.
item
seconds
-ENOENT;
hard
off,
bandwidth
runqueue
printk("
__read_mostly;
diag;
sprintf(buf,
fast
ready
pid_namespace
(and
case,
tail
graph
GFP_KERNEL))
*ctx)
kobj_attribute
event_trigger_ops
sched_rt_entity
*timer,
After
structures
period,
list,
(j
anything
cgroup_subsys
delay
sigset_t
gcc
Call
mm
messages
domains
.extra2
*fmt,
locked
mask;
received
IBM
section.
(if
sections
next;
page.
cnt
now.
place
rt_mutex_waiter
;
convert
regs,
dump_stack();
offset,
local_irq_enable();
busy
.stop
us.
name);
weight
affinity
CONT;
workers
mapping
SRCU
which_clock,
driver
option)
unless
3)
CPUs.
guarantee
having
Because
directory
position
ignore
lower
printk(KERN_CONT
%u
cases
header
failure.
execute
Thomas
resolution
group.
union
search
data);
op
Create
count)
give
task's
frequency
nsec
load_info
kimage
resource_size_t
invoke
2);
someone
<linux/syscalls.h>
link
walk
everything
limit
requested
*tmp;
moved
wants
low
rb_node
processing
info,
(p
entry,
event_filter
fail;
sk_buff
smp_wmb();
bpf_map
less
ret);
*tg,
expires
&zero,
protected
clockid_t
event_trigger_data
License,
grace-period
had
prior
HZ
callbacks.
list;
goes
save
(state
That
namespace
attach
current);
init
raw
torture
10
action,
per-cpu
DEFINE_PER_CPU(struct
amount
cpu.
slot
sched_dl_entity
deadline
insn
trace_kprobe
perf_cpu_context
rchan_buf
val)
(which
<linux/cpu.h>
future
disabled,
newly
info);
(c)
remaining
children
runs
enter
NULL))
-ESRCH;
able
BUG();
sizeof
nr
file);
stats
statistics
filp->private_data;
n);
ppos,
usage
text
@irq:
expiry
fmt,
@work
sysfs
r;
scan
account
well
lockdep_map
Also
beginning
*t,
waits
complete
Inc.
for_each_online_cpu(cpu)
%ld\n",
(1)
j;
error.
completed
detect
outside
val);
*head;
It's
.next
value,
put_online_cpus();
updating
An
sched_group
flush
bitmap
parameter
memory_bitmap
iteration
copied
Otherwise,
freezer
<linux/seq_file.h>
NMI
handled
preempt
come
things
faults
trace_seq_puts(s,
local_irq_disable();
safely
adding
ns
bio
Interrupt
devices
retry;
effective
CONFIG_FAIR_GROUP_SCHED
*cfs_rq,
again:
va_list
ctx
acquired
proc_dointvec_minmax,
tracepoint
r
"\t
include
starting
<linux/mm.h>
marked
related
saved
large
Clear
correct
ticks
Is
*name;
therefore
expected
fails
comment
-EAGAIN;
requeue
exists
continue
tmp,
sd
become
seq_operations
v;
overflow
"",
*sem)
policy
node);
cycle_t
program;
executed
idle,
Each
(argc
system.
resume
commit
'\n');
including
track
zero.
cmd
notify
not.
siginfo
simple
*name)
&iter->seq;
-ENOSYS;
prio
exception
.show
trace_uprobe
migrate
recursion
*key)
irq)
seq;
file->private_data;
srcu_struct
barrier();
notrace
states
Start
best
end)
start;
additional
PAGE_SIZE
nr_pages
reading
element
<linux/uaccess.h>
tasks.
Used
this.
ret,
users
we'll
dump
type;
protect
requires
(!event)
cpu_relax();
setup
balancing
(retval)
*se)
*tk
dyn_ftrace
<linux/mutex.h>
guarantees
*t;
updates
argc,
kzalloc(sizeof(struct
help
ERR_PTR(-ENOMEM);
buf);
migrated
determine
transition
*css,
short
architecture
*t)
5
dropped
becomes
too.
And
tell
vm_area_struct
*call
instance
out_free;
raw_spin_unlock_irqrestore(&rnp->lock,
'%s'
d_tracer,
moving
fill
events.
process.
ppos);
iter
entity
capability
*cfs_rq)
depth
runnable
*data
timekeeping
unbound
futex_hash_bucket
__lockfunc
<linux/spinlock.h>
idle.
2009
NOTIFY_OK;
main
0.
PAGE_SIZE)
(size
count);
Not
writing
*task;
below.
CONTEXT:
parent,
report
checked
helper
operation
*file;
.init
break
done;
unlock:
2,
*v,
relative
parameters
l
balance
itimerspec
CONFIG_RT_GROUP_SCHED
ip);
area
lines
lock_class_key
context,
whose
fully
previously
WARN_ON(1);
info;
Kernel
*page;
((unsigned
hibernation
containing
file,
responsible
didn't
equal
__set_current_state(TASK_RUNNING);
architectures
provide
equivalent
across
except
calculate
rec
various
kgdb_state
input
shift
ensures
might_sleep();
*ptr
adjust
cpu_rq(cpu);
nice
audit_krule
audit_names
(u32)
*iter
*rt_rq)
ftrace_probe_ops
<linux/delay.h>
<linux/percpu.h>
subsequent
useful
show
First
patch
addr);
pointers
made
making
highmem
ktime_get();
(count
leaf
on.
Allow
taking
returning
10);
false,
Foundation,
filter_parse_state
^
invalid
percpu
buf;
better
curr
enabled.
.type
func
temporary
next,
matches
bit,
file.
(!desc)
-EACCES;
writes
tick_sched
workqueue_attrs
gcov_node
mutex_unlock(&trace_types_lock);
tvec_base
cpu_buffer
desc->istate
<linux/kthread.h>
Should
exiting
linked
minimum
<<=
j++)
<linux/fs.h>
*head,
offset);
zero,
handler,
bother
Gleixner
s
entering
thread.
group,
(pid
ts;
method
set)
SMP
*field;
ring_buffer_event_data(event);
pos);
(!retval)
rather
watchdog
sysctl
ever
irq_to_desc(irq);
<linux/kallsyms.h>
threaded
*curr
lookup
device.
audit_tree
*prev,
*dev)
m->private;
ip)
kernel_param
padata_instance
fact
callers
require
Disable
(in
systems
seen
Mark
(addr
<linux/string.h>
gfp_t
node;
index;
@task
finished
2008
override
first.
immediately
processor
pi
current,
%true
case.
rely
stopped
read_unlock(&tasklist_lock);
@info:
args);
pc
(;
trace_handle_return(s);
*entry,
noinline
eBPF
verifier
preemptible
Does
earlier
perf_sample_data
lenp,
Generic
unlock
iter;
dl_rq
resched_curr(rq);
retry:
audit_entry
monotonic
printk(KERN_WARNING
enabled,
oneshot
entry)
pi_state
*cs)
for_each_subsys(ss,
request_queue
cleared
returned.
shouldn't
bad
.notifier_call
few
finish
debugging
2006
entire
types
zone
initialization
compute
*=
loaded
indicates
set_current_state(TASK_INTERRUPTIBLE);
str
private
m
signal_struct
*tsk
Note,
8
condition
ID
c
bpf_prog
*parent,
Skip
ref
torture_param(int,
(error
*filp)
sample
*rsp)
get_online_cpus();
cpu));
functions.
possibly
hardirq
cpumask_clear_cpu(cpu,
throttled
processes
IPI
CONFIG_SCHED_DEBUG
(!cpumask_test_cpu(cpu,
cfs_bandwidth
that's
stat
regs
DST
printk
gcov_iterator
*ppos
*seq,
virq,
mutex_lock(&trace_types_lock);
key;
perf_output_put(handle,
&tk_core.timekeeper;
.%-30s:
called.
*addr,
effect
callback.
kernel.
fmt
CONFIG_MODULES
**argv)
(diag)
<asm/uaccess.h>
contents
*buffer;
(!error)
data.
likely
appropriate
cgroups
irq);
upon
machine
sig
trap
By
this,
status
itself.
return.
-EFAULT
implemented
(see
mutex_unlock(&event_mutex);
tr,
str,
up,
Caller
*entry
%d,
particular
*rdp)
*rnp)
fetch
note
higher
this_cpu
page,
delta);
*rq;
stays
se);
iterate
environment
records
platform
BPF_X]
BPF_K]
*tr);
CONFIG_FUNCTION_GRAPH_TRACER
prevents
synchronize_sched();
schedule()
final
implements
Print
KDB_ARGCOUNT;
i--)
bit;
modified
(n
src
nr_pages,
mask)
assume
lock;
node.
otherwise,
__percpu
races
1]
sent
periodic
*s)
(!ret
(!p)
tsk
implement
debugger
getting
dynamic
mutex_lock(&event_mutex);
param
instructions
<linux/ftrace.h>
syscall_metadata
symbols
10,
idx)
printing
firsterr
printed
completely
yet.
inode->i_private;
@data:
separate
arguments
err:
nested
changing
smp_mb__after_unlock_lock();
round
_RET_IP_);
rules
jump_entry
IRQs
seq));
Function
highest
kuid_t
audit_chunk
*ctx,
trace_array_cpu
trace_buffer
CONFIG_TRACER_MAX_TRACE
*trace,
*domain,
gid
character
perf_output_handle
Elf_Shdr
buffer->buffers[cpu];
numbers
<linux/smp.h>
user-space
per-CPU
complete.
ordering
conditions
vector
provides
conflict
One
insert
restore
use.
management
__visible
*parent
away.
Once
CPU's
tracing.
CONFIG_RCU_BOOST
NULL.
no-CBs
leader
explicitly
who
siginfo_t
While
CONFIG_COMPAT
(!err)
pid_t,
(val
entry.
string.
typedef
idx;
WARN(1,
programs
Convert
synchronize
(trace_flags
pos,
preempt_count();
num;
Reset
for_each_possible_cpu(i)
out.
option
work);
(delta
nr_cpu_ids)
-EIO;
value;
extended
Keep
Calculate
cleanup
*iter;
type);
...)
prepare
@dev:
fire
audit_watch
64
(cnt
entry);
kernel_symbol
in.
device_attribute
echo
timeout,
(event->state
futex_key
module_attribute
printk_log
*cpu_buffer;
padata
interrupts.
indicate
function,
clean
0644);
good
implies
t,
t)
past
modules
contain
NOTE:
x
positive
to.
state;
dead
necessary.
Author:
protects
Any
Force
why
capabilities
provided
kick
PI
detection
Nothing
steal
siglock
we've
held,
average
problem
call.
non-zero
recorded
wrong
MA
skb
slow
<linux/err.h>
starts
unwind;
raw_smp_processor_id();
arg);
cpus,
looking
timestamp
reschedule
enable)
@p:
now)
-deadline
nanoseconds
expires;
*parent)
*ns
task);
ip
workqueues
timer.
refcount
attribute
prev,
.print
items
virq
length;
(ctx)
*ctx
*ops)
cpudl
subsystems
&one,
PPS
blk_trace
Linus
*desc;
consider
3;
similar
done.
frame
small
freeing
chain.
memory.
reduce
recursive
GP
1:
dynticks
successful
rest
code,
%NULL
lock->owner
subset
q
queue.
POSIX
read_lock(&tasklist_lock);
waking
larger
fixed
*ts)
timeout)
fix
*ops;
*op,
fn
Can
u16
BPF_ALU
4;
trace_seq_putc(s,
num
unregister
*key,
key,
attributes
again,
counters
single_release,
event;
delayed
rdp
advance
s,
for_each_cpu(cpu,
concurrent
common
new;
static_key
tsk);
mode)
Steven
rq,
*env,
*tg)
lb_env
parent;
id,
audit_log_end(ab);
*trace)
node)
event_command
tick_device
irq_chip
rem
*tp)
crash
cpuctx,
Paul
<linux/notifier.h>
well.
*head)
HZ)
further
detected
<linux/ctype.h>
*node;
pfn
creating
pr_debug("PM:
anyway.
Need
later.
releases
We're
lost
4)
perf
reboot
Register
registers
cmd,
ip;
current->comm,
mask);
remain
ptrace
attempt
kill
serialize
-1);
Always
tr);
BPF
*call)
*ignore,
HZ);
*hcpu)
duplicate
fd
key);
delta,
nohz
binary
cpus.
i++,
single_open(file,
rnp
OK
empty.
level,
"%s",
commands
repeat
current)
rq->lock
*mod;
*new;
now);
offsetof(struct
quota
__always_inline
adjustment
vma
@cpu
<linux/proc_fs.h>
serial
verifier_env
fmt);
[BPF_ALU
[BPF_ALU64
mutex_unlock(&audit_filter_mutex);
hash,
k_clock
CONFIG_DYNAMIC_FTRACE
s32
*tk,
kprobes
timeval
(long
*handle,
cgrp
*cpu_buffer,
though
Just
example,
head);
lists
synchronize_sched()
However,
Rights
command.
drivers
PAGE_SIZE);
apply
buffer;
interest
update.
hasn't
<mingo@redhat.com>
<linux/security.h>
%false
legacy
running,
sighand
I/O
sleep.
set);
(type
arg
pc;
resulting
used.
<linux/rcupdate.h>
names
HZ;
args
none
pair
*attr)
container_of(work,
i.e.
CONFIG_NO_HZ_COMMON
pull
observe
smp_rmb();
accounted
variables
interrupted
lockup
cpumask_set_cpu(cpu,
deadlock.
jump
(clone_flags
controller
desc);
switching
*ns)
*prev)
imbalance
busiest
);
right);
exist
4]
insn->dst_reg,
ab
trace_assign_type(field,
*iter);
irq_chip_generic
newline
expired
NSEC_PER_SEC
lock_usage_bit
rb
ftrace_page
NTP
lockdep_assert_held(&cgroup_mutex);
@buf:
+---+
*)0,
interrupt.
spurious
periods
CONFIG_DEBUG_LOCK_ALLOC
half
(but
Run
callbacks,
region
head;
Peter
PAGE_SIZE;
objects
smaller
greater
exact
image.
nr_pages;
<linux/freezer.h>
decrement
rcu_dynticks
Prevent
force)
kmem_cache
*n;
middle
soon
pid)
security
bound
filters
(type)
op,
&val);
b)
c;
coming
error,
install
action);
Prepare
WARN_ON_ONCE(1);
pick
*self,
%s",
2004
breakpoints
ok
e
seq_open(file,
success.
*)dest
Fetch
*link;
gone
(1UL
They
fall
hrtimer_restart
old,
PAGE_SIZE,
resources
synchronization
new);
*new)
spinlock
mode);
cpusets
sched_class
*se
*env)
GFP_KERNEL
*sd,
chance
raw_spin_unlock_irqrestore(&desc->lock,
task_cputime
spin_unlock(&hash_lock);
bucket
pc)
ubuf,
line,
cpupri
L:
Map
probes
(offset
*buf
@lock:
group_entry)
irqreturn_t
cgroup_mutex
*cgrp,
mems_allowed
hrtimer_clock_base
buffer->cpumask))
*image,
parallel_data
comes
asynchronous
Based
assign
current->lockdep_recursion
handler.
unknown
needed.
(*func)(struct
func;
others
Reserved.
address.
Inputs:
argv
possible.
BITS_PER_LONG
touch
pages,
Determine
pages.
mapped
performance
Copy
ERR_PTR(-EINVAL);
freezing
parent's
clearing
so,
off)
three
raw_spinlock_t
expedited
side
running.
tracking
hence
loop.
Currently
current->flags
sync
testing
matter
Test
Found
tasklist_lock
caused
automatically
notification
changed.
mode.
(for
mm_segment_t
Boston,
id;
pos;
is,
-ENOSPC;
fail:
f
disabling
rule
@flags:
(!entry)
name)
depending
open
double
module.
warning
offset)
*rnp
preempted
cpu))
uprobe_consumer
caller.
triggers
*event
errno
reprogram
wait);
nobody
ring_buffer_iter
trace_flags
kdb_printf("
min
nr;
task_struct,
absolute
stay
scaled
nodemask_t
preferred
parallel
careful
cpus_allowed
v,
converted
cnt);
IP_FMT
cputime;
fn,
?:
Lock
mutex_lock(&audit_filter_mutex);
*m)
mutex_unlock(&module_mutex);
unique
*ts,
overhead
sched_attr
next);
.free
read;
Copyright(C)
irq_base,
kretprobe
byte
*ctx;
values[n++]
trampoline
rec->flags
desc->status_use_accessors
cpuset.
cgroup_root
@cgrp
*ss;
mutex_unlock(&cgroup_mutex);
generated
Corporation,
<linux/types.h>
<linux/atomic.h>
*t
NOTIFY_DONE;
10;
tasks,
above.
kthread.
self
argc
(PAGE_SIZE
Memory
blocks
let's
radix
represents
attempting
work.
on,
frozen
*css)
@task:
descendant
invoking
perform
.seq_show
.read_u64
boosting
wait_queue_head_t
processed
atomic_long_t
Wake
Time
*rnp,
__maybe_unused
step
shutdown
(rc)
enqueue
hrtimer_sleeper
reached
(mask
ptracer
n,
signal.
current_cred();
domain.
@tsk:
sleeping
that.
successfully
accordingly.
(!access_ok(VERIFY_WRITE,
get_fs();
"trace.h"
integer
'\0')
compare
index,
free_page((unsigned
CONFIG_FUNCTION_TRACER
seccomp
(action)
phase
2.
reads
<linux/vmalloc.h>
rcu_torture
pr_cont("
1.
normally
%p
*ks)
error:
Avoid
push
issue
factor
(idx
(*pos)++;
seq_release,
c,
one,
point.
turn
OK,
Either
assigned
check.
Setup
CONFIG_NUMA_BALANCING
kgid_t
exclusive
XXX
*wq
*),
Rostedt
RING_BUFFER_ALL_CPUS)
subclass,
nsproxy
1000
prev);
*sd;
shares
fit
for_each_sched_entity(se)
/=
cfs_rq_of(se);
TODO:
lead
"%d\n",
per-task
operand
l;
tr;
(*pos
mod->name,
gcov
timex
*glob,
entry;
printk("\n");
preempt_enable_notrace();
*ts
mutex_unlock(&wq->mutex);
simple_read_from_buffer(ubuf,
@domain:
*tk)
pg
hb
mutex_unlock(&ftrace_lock);
*buffer)
pr_warn("%s:
taskstats
*kp)
module_kobject
@timer:
(RB_WARN_ON(cpu_buffer,
current->audit_context;
user-namespace
logic
16
results
exclusion
iff
occur
enables
location
assumed
pid);
<linux/list.h>
gfp_mask,
elements
counter.
memory,
that,
asmlinkage
PAGE_SHIFT;
migrating
seq_putc(m,
mask.
placed
8)
structure's
for_each_rcu_flavor(rsp)
counts
*nb)
nb);
nothing.
sig);
user_struct
space.
proper
*cred
t);
suitable
utime,
cancel
null
set_fs(KERNEL_DS);
replace
59
Temple
Suite
330,
len))
basic
*root,
Then
event_subsystem
ftrace_subsystem_dir
ops,
CONFIG_PERF_EVENTS
h
seccomp_filter
pointer.
*task
avoids
optional
Here
boost
sched_param
(firsterr)
primary
lock:
!
panic
(i.e.
dont
path.
active,
cycle
load;
usually
raw_spin_lock_irqsave(&rnp->lock,
Special
snprintf(buf,
alloc_percpu(struct
far
userspace.
Enable
completed.
description
first,
nr_cpu_ids
true)
virtual
which,
*a,
*b)
enable);
(!new)
details
for_each_tracing_cpu(cpu)
overruns
100
min,
seq_puts(s,
pinned
dl_bw
leftmost
root_domain
kept
sibling
nid,
fault
seq,
representation
onto
raw_spin_lock_irqsave(&desc->lock,
uid_t
check_reg_arg(regs,
@fn
cputime
conversion
ASCII
(!(trace_flags
klp_object
disables
@size:
tracers
tracer_flags
*next)
*mm,
fail.
rt_bandwidth
expires,
__func__,
Parameters:
seq_printf(seq,
max_active
name;
irq_hw_number_t
depth;
*flags);
kmsg
*op;
data)
@cgrp:
ssid)
(mod->state
(int),
hrtimer_cpu_base
*base
compressed
(result
local_t
relay
*cpu_buffer)
f->val);
*context
rwbs[i++]
triggered
destroy
B
down.
(t
removing
pr_fmt(fmt)
start)
end,
(p)
<linux/device.h>
page;
saveable
(!page)
snapshot_handle
idea
(!buf)
2007
Foundation.
do.
*pos;
freeze
*cft)
Internal
structure,
*parent;
->completed
invoked.
array.
certain
rt
<linux/ptrace.h>
sig)
wakes
consumed
dequeue
parent.
characters
overrun
locked.
ancestor
miss
(action
supported
*pred,
*(u32
WARN_ON(ret);
"%s\n",
*call,
32-bit
Clean
iter->ent;
trace_buffer_lock_reserve(buffer,
((struct
pr_cont("\n");
spinning
spin
.priority
Take
software
sector_t
arg;
dev_t
<linux/file.h>
insn->imm
however
.owner
online.
trace_probe
<linux/time.h>
Record
sort
configured
there.
FIXME:
(entry
mod
group_info
filled
@q:
detach
seq_printf(s,
constraints
*bp)
task_rq_unlock(rq,
(unlikely(ret
se
Look
20
*cfs_rq
Put
selected
forward
(rc
args;
(opcode
err_free;
delta)
__field(
__field_desc(
serialized
'\n')
(__force
nsecs
event))
from_kuid(&init_user_ns,
tracefs
masks
(write)
irq_work
hits
mutex_lock(&wq->mutex);
storage
irq_chip_type
rem;
*hash,
raw_spin_unlock(&lock->wait_lock);
dependencies
*class)
uval,
ftrace_enabled
mutex_lock(&ftrace_lock);
(unlikely(ftrace_disabled))
(!ab)
alarm_base
optimized_kprobe
*ent)
qos
handler_errors++;
false))
known
mutual
block.
rcu
stall
*this,
*g,
barriers
sees
License.
Remarks:
reserve
random
(as
tree.
dst
pages;
frames
alloc
more.
ones
*buf;
thing
verify
according
execution.
towards
*rsp;
progress.
tries
leaving
Read
consume
,
userland
paths
spinlock_t
count.
preserve
PENDING
entered
progress
restart_block
PID
CONFIG_KGDB_KDB
*data);
file->event_call;
parse_error(ps,
ftrace_event_field
optimize
several
rlimit
Common
<linux/errno.h>
maps
includes
&flags,
Verify
remote
User
pairs
missed
*m
THIS_MODULE,
rdp->cpu,
properly
above,
i))
sections.
worry
j,
rnp,
CPUs,
handles
enqueued
elapsed
soft
big
label
@new:
*wq,
.private
desc
<srostedt@redhat.com>
trylock
bp
branch
slice
CONFIG_SCHEDSTATS
Store
rate
*mm
(end
constant
value)
resource,
cgroup.
autogroup
kernel_cap_t
dev);
opcode
trailing
*owner;
addresses
owner,
mutex_lock(&module_mutex);
klp_patch
@iter:
audit_parent
ftrace_graph_ent
*cmd,
mm,
request,
concurrency
timer,
pools
I:
pwqs
*pool)
hwirq
waiter);
(class->usage_mask
desc,
sizeof(u64);
SINGLE_DEPTH_NESTING);
executable
TID
mod,
*cp,
cgrp_cset_link
mutex_lock(&cgroup_mutex);
out_finish;
cpuset_mutex
int),
swap_map_handle
subbuf_size
cp
time_status
debug_alloc_header
stuck
kernel,
Rusty
invocation
CONFIG_PROVE_LOCKING
assumes
*head
queue,
reach
cond_resched();
accesses
*mod
None.
diagnostic
kdb_printf("\n");
%ld
creation
allocating
room
arbitrary
New
number.
CONFIG_HIGHMEM
present
saving
Compute
desired
Let
done,
size.
%lu
fails,
restored
belongs
lazy
dying
periods.
active.
*rdp,
mean
<linux/reboot.h>
off.
cmd);
limited
sufficient
'%s'\n",
sigqueue
<linux/capability.h>
Tell
*mask,
passing
permissions
Unlike
information.
probably
application
instead.
unlocked
vs
stores
Please
@pid:
Send
(const
locks.
match;
@len:
*rec;
idx,
&tr->events,
filter.
failing
lowest
smp_mb__before_atomic();
out_free:
(
(id
warn
idx);
queued,
causes
KGDB
kgdb
locks,
*ptr;
bpf_insn
nr_running
stuff
scale
*unused)
*rnp;
*dest)
vaddr,
filename
ctx,
*mm)
profile
smp_mb__after_atomic();
tests
words,
rdp);
raced
Advance
Stop
took
direct
cpu_online_mask);
retry
compiler
spent
*old;
new,
%p\n",
waitqueue
paired
bit.
*cp;
live
ERR_PTR(err);
tsk,
-EOPNOTSUPP;
RUNTIME_INF)
select
found,
raw_spin_unlock(&rq->lock);
diff
NSEC_PER_USEC;
freq
sg_lb_stats
*action)
),
gid_t
*ab,
watch
reg_state
*const
verbose("invalid
fields\n");
overwrite
[BPF_JMP
spin_lock(&hash_lock);
*ab;
iter->ent);
allocated,
cmpxchg
tested
parts
int)
options
__initdata;
Adds
*info;
*tr;
id);
spaces
expire
CONFIG_NO_HZ_FULL
question.
line.
enabling
*child,
@child
preempt_disable_notrace();
&data,
read,
CONFIG_HIGH_RES_TIMERS
<linux/workqueue.h>
@wq:
owner.
*nh,
regs))
Write
'\n';
sched_clock()
curr->held_locks
hlock,
locks:
*cgrp)
futex_pi_state
(ops->flags
*pg;
hlist)
(!retval
MODULE_STATE_UNFORMED)
-ENOEXEC;
*cs,
&left,
timer's
firing
error_packet(remcom_out_buffer,
mutex_unlock(&kprobe_mutex);
read_seqcount_begin(&tk_core.seq);
(read_seqcount_retry(&tk_core.seq,
mult
bitcount;
prefix
depends
<linux/hardirq.h>
rcu;
statically
dynamically
consistent
offline,
out,
so.
*list;
empty,
by:
once.
potentially
*info
*start,
<linux/suspend.h>
(res
(this
nodes.
together
parameter.
Sets
kmalloc(sizeof(struct
Image
destroyed
Tasks
regardless
synchronized
E.
Process
Even
1];
partition
kthreads
unregistered
priority.
immediate
Timesys
API
ignored
sig;
killed
events,
*regs
sighand_struct
reported
Also,
run.
deal
sense
window
System
remember
upper
k
backwards
old;
6
op;
*rec)
down,
trace,
-EEXIST;
FILTER
b
d
""),
(c
share
-EINVAL
(data
tracer.
str);
tr->trace_buffer.buffer;
trace_event_functions
.trace
container_of(p,
CONFIG_PREEMPT
func);
torture_type,
started");
exit.
ts,
happen.
100;
fdput(f);
bpf_func_proto
async
With
smp
-EBUSY
polling
*arg,
probe_arg
<linux/kernel_stat.h>
dyntick-idle
*rdp;
operations.
true.
Adjust
*rdp
trace_rcu_grace_period(rsp->name,
work,
section,
64-bit
protection
stamp
policy,
CLOCK_MONOTONIC,
event->state
*nfb,
releasing
May
task:
delayed_work
modification
irq;
usecs
manually
little
update_rq_clock(rq);
*next
fastpath
raw_spin_lock(&rq->lock);
CFS
gives
segments
1024
rounding
sanity
traced
audit_state
umode_t
__u32
(-EINVAL)
*old,
optimization
(class
insn->off;
BPF_MEM
struct_name,
@name:
("
cpuacct
*entry)
hlist_node
per_cpu_ptr(tr->trace_buffer.data,
PM
@p
":
Module
loading
mod->name);
What
posix_clock
item)
*ppos,
ftrace_graph_ret
trace_parser
*class;
Can't
(tmp
circular
*d,
CONFIG_NUMA
Description:
*pt_regs)
*buffer
*rt_se,
Display
&file->flags);
*n)
*pool
pr_info("
written;
(attr
Size
virq;
tracepoint_func
pr_warn("error
(name)
itimerval
trace_array_put(tr);
events:
exit;
irqd_set(&desc->irq_data,
MSI
*cpuctx,
sec
(read_format
*uaddr,
optimized
*base,
signature
section_objs(info,
%11lu\n",
pid_type
(txc->modes
(gid_t)
(uid_t)
padding
*cp
*uprobe,
*pinst,
<linux/irq.h>
Read-Copy
McKenney
CREATE_TRACE_POINTS
RCU.
rcu_read_lock()
Will
(state)
Invoke
(event
stack,
<linux/compiler.h>
sizeof(void
form
(pfn
curr;
*dst,
pointed
Release
stop;
atomically
1),
descendants
initiate
destruction
fork
Task
*css
#elif
Current
CONFIG_RCU_NOCB_CPU
etc.
duration
Torvalds
0:
Default
system,
2004-2006
<linux/pid_namespace.h>
2:
++i)
HZ,
notified
(p->flags
PF_EXITING)
eligible
exactly
mechanism.
16;
*flags)
members
current))
realtime
switched
clears
yet,
return,
receive
stops
find_task_by_vpid(pid);
regex
*str,
*ps,
*filter)
DATA_REC(YES,
"%s
long),
<linux/completion.h>
rcu);
important
Corporation
refcnt
compatible
(val)
dest
this_rq();
@n:
cycles
128
errors
regular
"");
smp_hotplug_thread
smp_processor_id());
cpu),
follows
USA
Failed
fetch_type
string,
uprobe_cpu_buffer
dsize);
file;
*key
rcu_get_root(rsp);
usermode
haven't
partial
rdp,
Move
looks
us,
increase
Using
routines
call_single_data
appear
activate
comments
(iter
references
LSM
Invalid
mutex_waiter
nr_irqs);
period;
Account
*rt_rq
task;
worst
1000;
bitmask
diff;
*tsk;
read-only
*curr)
detached
aren't
ns;
char,
verifier_state
verbose("(%02x)
SRC_OP);
i++;
grab
directly.
.write_u64
*waiter)
remains
<linux/hrtimer.h>
u64)
stime
enforce
Needs
text,
fsnotify_mark
*map,
tracer_stat
(start
TASK_UNINTERRUPTIBLE);
(v
filesystem
tracer_opt
skip,
files.
CONFIG_CGROUP_SCHED
tracer_enabled
*rt_se)
state);
kdb_printf("%s:
(file->f_mode
');
*work,
@work:
*pwq;
spin_unlock_irq(&pool->lock);
prev;
rusage
hrtimer_mode
*cgrp;
cpuctx
tstamp
came
ops->flags
ftrace_profile
reprogramming
pr_err("%s:
*cgrp
cset
*val,
mod->state
&modules,
@cs:
*base)
auditd
Address
thr
subprocess_info
ww_mutex
ww_acquire_ctx
mutex_lock(&kprobe_mutex);
tk->tkr_mono.xtime_nsec
log_flags
event_probe_data
audit_field
oldlen,
CTL_STR,
newlen)
xol_area
uprobe_task
{{
mechanism
<linux/tick.h>
enabled)
c)
limits
till
terminated
ensuring
0444);
generate
console_loglevel
(strcmp(argv[0],
allocations
build
easy
*bm,
pfn,
freed.
copies
During
Helper
base);
%u\n",
*handle)
inherit
grabbing
nesting
CBs
jiffy
level;
rnp)
itself,
call_rcu()
jiffies.
Maximum
field.
defines
arg)
Corp.,
belong
globally
4:
Given
word
stop.
process,
signr
flag.
they're
latter
change.
spin_unlock_irq(&current->sighand->siglock);
XXX:
causing
failed,
relevant
close
compat_uptr_t
"Illegal
strings
filter;
*ps)
filter,
m,
alignment
BPF_K:
filter)
Validate
Drop
affect
increments
safe.
3,
""
end:
4,
rcutorture
reuse
(!torture_must_stop());
(the
sync,
-E2BIG;
done:
no_llseek,
registration
implementations
obtain
e)
catch
per_cpu_ptr(rsp->rda,
rsp,
poll
list_for_each_entry(event,
probed
used,
DEFINE_PER_CPU(int,
this_cpu_ptr(&rcu_dynticks);
permitted
maintain
rdp->mynode;
jiffies,
ends
working
Similar
removed,
deferred
Give
leak
returns.
synchronize_rcu();
parameters.
arch_spinlock_t
seconds.
is.
HRTIMER_RESTART;
Let's
HRTIMER_MODE_REL);
expects
@func:
spread
Zijlstra
mod);
mod;
successful,
prepare_creds();
Install
*new,
Change
current_user_ns();
nr,
&wait);
C
((flags
ns);
archs
*dev_id)
queueing
rq.
*timer
delta_exec);
is:
siblings
vruntime
MB
*ns,
difference
cross
interval;
nr_node_ids;
(queued)
(e.g.
wl
GFP_NOWAIT);
.get
pointing
accessed
va_start(args,
va_end(args);
insn->code,
pointer,
insn->off
walking
item,
})
ctx;
(DST
CONT_JMP;
__initdata
lets
exist,
*f,
f,
values.
versions
klp_func
sym
clocksource.
gcov_ctr_info
IF_ASSIGN(var,
pc,
trace_enum_map
time;
nearest
p->prio
clone_flags,
*param,
raw_smp_processor_id(),
0555,
sd;
*d)
display
tr->max_latency
compat_timespec
Check,
"Display
FMODE_READ)
command)
stack_trace
default_llseek,
already.
@worker:
@worker
@nh:
tracing_open_generic,
*ct
(data)
hwirq,
controllers
@lock
base,
kretprobe_instance
cnt)
seq->private;
backtrace
trace_enum_map_item
(tracing_disabled)
NOTICE
SEQ_PUT_FIELD(s,
ftrace_func_command
[L]
futexes
hlock
curr->lockdep_depth;
perf_event_header
driver.
event->ctx;
cgrp)
(is_cgroup_event(event))
swevent_htable
KDB
kernfs
ssid))
kernfs_node
cgroup_pidlist
*kp;
(cp
mutex_unlock(&cpuset_mutex);
nr_threads;
wait_opts
"..
netlink
fgraph_data
stat_session
00
console_unlock();
rchan
for_each_buffer_cpu(buffer,
QoS
pm_qos_request
list_for_each_entry(n,
write_unlock(&resource_lock);
res->end
*bt
@val:
in-kernel
performed
intended
and,
extend
Corp.
magic
<linux/kdb.h>
*addr)
touch_nmi_watchdog();
5;
inactive
argv,
N
List
once,
rtree_node
mem_zone_bm_rtree
*zone;
adds
*node,
How
levels
nor
cur
pfn)
bits,
*page)
chunk
free;
stop,
all.
swsusp_info
Save
snapshot.
Restore
cgroup,
css_task_iter
Snapshot
forcing
initialized.
(HZ
CONFIG_RCU_TRACE
7
exported
registered,
cases,
daemon
w
*mask)
current->pid,
RETURNS:
~mask;
*q)
Notify
allowed.
wasn't
found.
pretend
group)
Queue
unlock_task_sighand(p,
PIDTYPE_PGID,
stime;
passes
8;
Whether
e.g.
spin_lock_irq(&current->sighand->siglock);
enough.
places
bail
-EINTR;
@ts:
somewhere
USA.
<linux/perf_event.h>
"trace_output.h"
parse
*d
WALK_PRED_DEFAULT;
*filter;
list_for_each_entry(file,
a,
*root)
-errno
creates
inherited
BPF_X:
(mode
installed
order)
32bit
"%s:
irq_flags,
*file
<linux/moduleparam.h>
testing.
torture_random_state
.readlock
.read_delay
.readunlock
pr_alert("%s"
TORTURE_FLAG
%d",
prints
David
mode;
GFP_USER);
bigger
feature
*end;
"sched.h"
sampling
affected
@x:
definition
\Sum
<linux/debugfs.h>
m->private
smp_processor_id())
td
runqueue.
seconds,
Place,
02111-1307
event)
*value
way,
*rdtp
(not
2))
finally
in,
supposed
*next,
bit)
head)
called,
Fix
<linux/sysctl.h>
<linux/sched/rt.h>
guest
perf_event_attr
.size
traces
this_cpu;
contexts
(cpumask_test_cpu(cpu,
iter,
fd,
thread_info
@mode:
(*cp
contention
*sem,
namespace,
ns_common
couldn't
(!(flags
instances
HRTIMER_NORESTART;
delta_exec;
earliest
else.
*se,
cfs_rq->min_vruntime;
CONFIG_64BIT
(task)
numa
net
use,
work;
se,
%=
length,
fair
for_each_cpu(i,
Load
saves
collect
raw_spin_unlock_irqrestore(&rq->lock,
resources.
protection.
2005
(BPF_SRC(insn->code)
edge
loops
F_STRUCT(
(true)
nsec;
(u64)
local_save_flags(flags);
off;
({
<linux/mount.h>
*s;
s;
__buffer_unlock_commit(buffer,
ap);
acquiring
cpu_relax_lowlatency();
proceed
infrastructure
suspend_state_t
record.
print,
ent,
(retval
question
.child
printk(KERN_DEBUG
sched_domain_attr
NSEC_PER_SEC;
uts_namespace
":");
CONFIG_TRACER_SNAPSHOT
posix
pool->lock
WQ:
*pool;
color
@pool:
*worker;
rescuer
@wq
nr_to_call,
r);
@d:
nr_irqs,
*domain)
linux
@parent:
base;
(left
nokprobe_inline
*name
symbol_cache
kallsyms
pr_info("Testing
recording
fails.
clockid_t,
rounded
allocated.
msg
SEQ_PUT_HEX_FIELD(s,
generic_file_llseek,
tracing,
*ret
[P]
acquires
printk("[
order);
2003
timers.
u
(NSEC_PER_SEC
PERF_EVENT_STATE_INACTIVE)
perf_output_put(&handle,
kfree(buf);
q->lock_ptr
ftrace_func_entry
ftrace_iterator
(!(torture_random(trsp)
down_read(&css_set_rwsem);
up_read(&css_set_rwsem);
info->hdr->e_shnum;
&cs->flags);
cs
mutex_lock(&cpuset_mutex);
spin_lock_irq(&callback_lock);
spin_unlock_irq(&callback_lock);
secs
%11llu\n",
leap
print_name_offset(m,
*sp)
CONFIG_SUSPEND
audit_log_cap(ab,
*desc);
-EINVAL);
strcpy(remcom_out_buffer,
iter->private;
kp);
raw_spin_lock_irqsave(&timekeeper_lock,
raw_spin_unlock_irqrestore(&timekeeper_lock,
tasklet_struct
#x,
trace_rcu_nocb_wake(rdp->rsp->name,
dah_overhead
write_lock(&resource_lock);
exit_free;
blk_io_trace
"internals.h"
potential
(we
http://www.gnu.org/licenses/gpl-2.0.html.
CONFIG_PROVE_RCU
when:
activated
secs,
for.
Control
arrived
transitions
allowing
entries.
subject
<linux/nmi.h>
filtered
trace.
chain_allocator
represent
leaves
bitmaps
*list
*list)
order.
updated.
buffer);
keys
swsusp_free();
j);
@buf
eventually
it;
kernfs_open_file
nbytes,
worth
Last
drain
head.
end.
aware
reasons
exited
name.
switches
follow
typically
Calls
rtmutex_chainwalk
functions,
*task);
<linux/compat.h>
cleared.
sending
threads.
force);
p))
delivered
&flags))
*action;
&utime,
interested
went
explicit
stable
sized
compat_sigset_t
from,
plus
field,
(!error
TASK_RUNNING
root;
err,
(call->flags
8:
ops;
*count
&count);
failure,
reset,
manage
accessing
ERR_PTR(ret);
validate
syscalls
nr)
id)
facility
*p);
bug
1000);
mutex,
test.
licensed
reaches
key)
handle;
lock_system_sleep();
unlock_system_sleep();
bpf_attr
*map;
fixup
GPL
nr_active
:=
result.
ran
relies
flip
*this_rq,
cpu_possible_mask);
%lu\n",
free_out;
park
*td;
per_cpu
*(type
location.
src,
pr_info("Failed
(%d)\n",
<-
methods
incremented
debugfs
seeing
possibility
Now,
check,
lockless
array,
changed,
hierarchy,
So,
Thus
0));
softirqs
cookie
forced
_rcu_barrier_trace(rsp,
variable.
operation.
fired
physical
block_device
<linux/gfp.h>
@wait:
wait)
put_cpu();
finish.
sum;
end);
@start:
Written
abort_creds(new);
from.
"CRED:
(current->flags
p->state
standard
KDB_ENABLE_ALWAYS_SAFE);
<linux/utsname.h>
max)
routines.
*bp,
enable,
slots
Device
*dl_rq)
task_rq(p);
*dl_se,
possible,
point,
fits
rq->curr;
(next
topology
for_each_domain(cpu,
sd)
(sd->flags
CONFIG_CFS_BANDWIDTH
entities
Iterate
curr);
numa_group
actively
domain,
treated
callback_head
*vma;
(vma->vm_flags
up_read(&mm->mmap_sem);
contrib
expiration
*cfs_rq;
boundary
S
we'd
raw_spin_lock_irqsave(&rq->lock,
sg;
'struct
new_value);
seq_printf(p,
desc->action;
uid;
reg
insn->src_reg,
class;
valid.
FILTER_OTHER
underlying
Added
BPF_R0
__weak;
(!s)
reorder
(!call_filter_check_discard(call,
atomic_dec(&data->disabled);
.funcs
.reset
CONFIG_FTRACE_SELFTEST
writers
raw_spin_unlock_irqrestore(&sem->wait_lock,
*obj)
disabled;
*info);
links
ts);
.clock_getres
.clock_get
dev,
(index
swapped
*event);
flag,
Cannot
defined(CONFIG_SMP)
clocks
Valid
j)
deleted
waiters.
*tp
kdb_bp_t
__func__);
Zero
@ops:
event_trigger_init,
@type:
de
per_cpu(cpu_profile_hits,
tick_period);
WARN_ON_ONCE(!irqs_disabled());
KTIME_MAX;
wq
CONFIG_SYSFS
wq)
@pwq
spin_lock_irq(&pool->lock);
kstrtoul_from_user(ubuf,
hwirq);
*tp,
*ri,
(u8
entry->ip
warn++;
@s:
save_len;
args)
hex
compat_ulong_t
align
TASK_COMM_LEN);
"\t\t\t
raw_spin_unlock_irqrestore(&task->pi_lock,
curr->comm,
lock(");
printk(");\n");
print_kernel_ident();
printk("\nstack
backtrace:\n");
irqclass);
(!mark_lock(curr,
raw_local_irq_save(flags);
raw_local_irq_restore(flags);
*rb;
*rb)
irqd_clear(&desc->irq_data,
*msg
msi_domain_info
bsd_acct_struct
*cpuctx;
*css;
*pmu)
hw_perf_event
day
uaddr2
kthread_worker
@pos
csses
subsys
down_write(&css_set_rwsem);
up_write(&css_set_rwsem);
list_for_each_entry_rcu(mod,
**/
*negp
timer->base
*skb;
avail
audit_log_start(context,
LZO
thr++)
error);
&timer_debug_descr);
@platform_mode:
platform_mode)
log_first_seq;
log_first_idx;
raw_spin_unlock_irq(&logbuf_lock);
syslog,
subbuf_size;
PM_SUSPEND_FREEZE
event->type_len
pm_qos_object
async_cookie_t
temp_start
called\n");
CONFIG_RCU_NOCB_CPU_ALL
(!diag)
bytesperword
@targ
__blk_add_trace(bt,
IRQS_PENDING;
(desc->istate
detailed
cases.
member
elapsed.
finished.
debug_obj_state
Limit
waited
beyond
started.
to,
invokes
local_bh_disable();
structures.
Wind
River
Systems,
Outputs:
Locking:
proc
*)addr,
"power.h"
included
represented
linked_page
*))
bits.
tree,
Functions
PG_UNSAFE_CLEAR);
*bm)
extents
representing
corresponds
*addr;
well,
*src)
tables
Total
released.
Suspend
(nr_pages
happen,
decrease
failed\n");
End
(!buffer)
reason);
*page,
created.
freezer->state
cgroup_taskset
&it);
@state:
level.
Are
hierarchy.
Mask
boosted
Place
visit
batch
offline.
OOM
determined
Where
fields.
activity
*cmd)
Unregister
available.
1UL
*waiter,
&~
@mask
*q;
k_sigaction
m;
stopping
pending.
deadlocks.
*pid)
leader.
&stime);
cleaned
parent);
gone,
tasklist
behavior
consecutive
wakeup.
namespace.
tsk;
spin_unlock_irq(&tsk->sighand->siglock);
*param)
sigsetsize)
please
belonging
(!access_ok(VERIFY_READ,
SLAB_PANIC);
'\0'
move_type
pred
*filter,
considered
root,
ch;
'"')
left,
committed
2012
<linux/audit.h>
BPF_JMP
*child)
strict
snprintf(buf
sizeof(*entry),
rctx;
sizeof(u32),
sizeof(u64));
"Number
ts
occasionally
think
cond_resched_rcu_qs();
rcu_torture_writer_state
(!kthread_should_stop())
smp_mb()
tracing_off();
oops
module,
IO
Unlock;
filp);
notifiers
values,
dev;
map;
macro
attaching
mess
(long)
load,
keeping
contribution
tick.
balance.
*rsp
CPU-hotplug
outgoing
attempts
ent;
type)(struct
u32,
*tu,
event_file_link
(file)
event:
<linux/random.h>
r3,
r4,
preemption.
RCU-sched
oldval,
queues
Linux
ULONG_MAX
Kick
Attempt
future,
progress,
requests
recent
required.
Report
Walk
disallow
%d:
counting
softirq_action
invocation.
specify
anyway
ahead
last,
ordered
accept
CPU_DEAD:
systems.
ULONG_MAX)
2010
detector
twice
rw,
cpu's
nodemask
@func
ids
moves
<pzijlstr@redhat.com>
*)(unsigned
overlap
CONFIG_DEBUG_CREDENTIALS
query
subjective
behalf
wait_queue_t
place.
*wait,
2005-2006,
subclass)
*ns;
1000,
<linux/kprobes.h>
*res,
occurs
identity
*rq);
runtime,
container_of(timer,
throttle
We'll
cpumask_test_cpu(cpu,
rq->curr
(!task)
math
<linux/profile.h>
const_debug
Enqueue
rss
distance
around.
keeps
*work
*tg;
tg
occurred
accumulated
consuming
owned
rq's
*cfs_b
raw_spin_unlock(&cfs_b->lock);
expires)
RUNTIME_INF;
Per
subtract
schedstat_inc(p,
serialization
~CPU_TASKS_FROZEN)
Ignore
reap
nr_irqs;
uid,
audit_tree_refs
(BPF_MODE(insn->code)
regno,
(off
discovered
explored
identifier
%lx
Russell
cpu_stop_work
*work;
repeat;
stop_machine()
wakelock
active;
utime
clock;
ptr;
2002
address,
*inode
key_size);
hash);
modules.
X
front
waiter;
freezable
@node:
*func;
object.
rtc
gcov_fn_info
checksum
anything.
(!iter)
iter->pos
posix_clock_desc
tstruct,
entries;
individual
with.
old_flags,
There's
Thus,
Removes
*child;
sleep,
sched_clock();
Callers
depth,
first;
tracing_reset_online_cpus(&tr->trace_buffer);
(!pid)
*rt_rq,
tick_do_timer_cpu
__ref
incr
this_cpu_ptr(&tick_cpu_sched);
days
HRTIMER_MODE_ABS);
manager
flushing
for_each_pwq(pwq,
*wq)
mutex_unlock(&wq_pool_mutex);
match.
comma
unmodified
max,
sizeof(buf),
flow
*chip
nr_irqs)
nests
commit_creds(new);
__trace_seq_init(s);
(s->full)
s->full
out_err;
timezone
tracing_start();
tracing_stop();
pr_warning("**
**\n");
-EBADF;
clock.
**data)
put_task_struct(task);
<0
lock_class_stats
(!name)
]\n");
printk("%s/%d
lockdep_print_held_locks(curr);
dir
*timer;
clock_id,
*msg)
*ops
exp
perf_cgroup
timer);
raw_spin_unlock_irq(&ctx->lock);
value);
&event->hw;
current->mm;
p->flags
&ftrace_list_end;
ftrace_profile_stat
hash.
lock_torture_ops
(cxt.nrealwriters_stress
GOT_YOU_MORON
css_set.
@ss
ssid;
ns)
*mattr,
*mk,
*size,
num)
cp);
cs->flags
*cs
atomic_add_return(1,
%TRUE
kbuf
write_unlock_irq(&tasklist_lock);
rcu_ctrlblk
infop)
rcu_batch
trace_test_buffer(&tr->trace_buffer,
auditing
listeners
out_clean;
spin_unlock_irqrestore(&base->lock,
_RET_IP_,
"OK");
optimized_kprobe,
readout
tk_read_base
xtime_nsec
write_seqcount_begin(&tk_core.seq);
write_seqcount_end(&tk_core.seq);
bpage
prctl_mm_map,
syslog
msg->flags;
kmsg_dumper
*newval,
kdb_printf("%s",
!trace_seq_has_overflowed(s);
pm_qos_constraints
(result)
(!(time_status
pr_warn("crashkernel:
cap)
defcmd_set
q->blk_trace;
begin
portion
desc)
raw_spin_unlock_irq(&desc->lock);
happened
masked
<linux/bitops.h>
act
illegal
boot.
tracked
stack.
Finally,
in-flight
default.
Pick
for_each_process_thread(g,
bool,
inform
Debugger
bt
mask))
&nextarg,
&addr,
&offset,
functionality
Pavel
J.
GPLv2.
<linux/console.h>
5)
image,
gfp_mask)
__free_page(page);
initializes
extent
More
*addr
nodes,
(bit
Basic
themselves
*src,
terminate
nr_meta_pages
@mask:
them,
Normal
ones.
page_address(page);
(buffer)
Assumes
completion.
addition
<linux/cpumask.h>
CONFIG_NO_HZ_FULL_SYSIDLE
GP.
CONFIG_RCU_CPU_STALL_INFO
scheduling-clock
statistics.
Next
acquisition
DECLARE_PER_CPU(struct
*rnp);
width
tools
<linux/syscore_ops.h>
impossible
shutting
immediately.
Execute
obvious
trust
Instead
(cmd)
arg,
interrupt,
NOT
*lock);
*lock;
helpers
1992
POSIX.1b
SIG_IGN
signals.
sigpending
synchronous
*sig
Our
notice
(sig
P
from_kuid_munged(current_user_ns(),
away,
*pid,
lose
info.si_code
@tsk
calls.
&info);
Schedule
Every
Other
expect
spin_lock_irq(&tsk->sighand->siglock);
sizeof(sigset_t))
(!err
*vma)
filtering
cmp
dereference
*r,
^=
OR
*root;
(pos
TRACE_EVENT_FL_USE_CALL_FILTER)
(op
fold
*call;
CONFIG_FTRACE_STARTUP_TEST
DATA_REC(NO,
"Failed
6,
length.
skip;
reverse
leading
64bit
TRACE_TYPE_UNHANDLED;
long);
tp
sizeof(*entry)
trace:
dependent
NSEC_PER_USEC);
rcu_torture_ops
2000
*rhp)
much,
set_user_nice(current,
(long)hcpu;
CPU_ONLINE:
CPU_DOWN_PREPARE:
Duplicate
%lx\n",
Interrupts
Enter
old_fs
map,
verification
uattr,
expensive
late
shift;
*this_rq)
flipping
load.
NOHZ
10))
ticks)
table,
Therefore
wakeups
rsp->n_barrier_done);
rnp);
cpu_to_node(cpu));
died
timed
problem.
quite
*group,
tail,
Increment
Parse
FMODE_WRITE)
dsize;
Event
*d_tracer;
d_tracer
(IS_ERR(d_tracer))
r1,
r5)
.ret_type
export
responsibility
only.
future.
accounting.
this_cpu_ptr(rsp->rda);
Exit
exit:
example
units
rnp->gpnum
s);
trace_rcu_future_gp(rnp,
useless
raw_spin_unlock_irq(&rnp->lock);
rdp->qlen_last_fqs_check
loop,
contention.
fine
undo
(!strncmp(str,
task_pid_nr(current));
unable
(rw
correctness
supplied
balancing.
percpu_rw_semaphore
run-time
entries,
mod))
exits
session
*old)
controls
old_uid_t,
old_gid_t,
kgid;
GROUP_AT(group_info,
CONFIG_DEBUG_MUTEXES
lock->wait_lock
Nadia
Yvette
spin_lock_irqsave(&q->lock,
spin_unlock_irqrestore(&q->lock,
@key:
waiter.
//
interruptible
bit);
&wait,
hashed
cpu)->disabled);
avg
*context,
RB_ROOT;
(p->nr_cpus_allowed
unlikely
task_rq_lock(p,
SCHED_DEADLINE
overloaded
rq_clock_task(rq);
finds
<tglx@linutronix.de>
load_weight
(s
intermediate
dist)
balanced
(cur
swapping
100)
down_read(&mm->mmap_sem);
32;
(running)
*tg
se->vruntime
raw_spin_lock(&cfs_b->lock);
cfs_rq->runtime_remaining
next:
slack
racing
&p->se;
schedstat_inc(sd,
*tmp,
sd_lb_stats
environment.
class.
rq;
all,
Search
second.
case:
elem
key.
*state
(arg_type
regs[insn->dst_reg].type
inserted
macros
happens.
container,
")\n\t=>
(*fn)(void
sources
(!len)
preempt_count
cputime,
*skb,
*e;
*tree)
audit_log_untrustedstring(ab,
map);
ftrace_branch_data
.selftest
----
discarded
raw_spin_lock_irqsave(&sem->wait_lock,
%current
*sym;
obj->funcs;
unload
RTC
*value)
store_gcov_u32(buffer,
kfree(iter);
*clk
tr
CONFIG_STACKTRACE
parsing
CONFIG_PROC_FS
<linux/debug_locks.h>
buf[64];
SCHED_FIFO
"BUG:
preempt_count());
rcu_read_unlock_sched();
proc_doulongvec_minmax,
rd
Build
cpumasks
cpusets.
set_tracer_flag(tr,
.set_flag
.close
rt_rq);
jiffies)
freq);
KDB_MAXBPT;
instruction.
enable_trigger_data
out_put;
van
<linux/posix-timers.h>
"tick-internal.h"
alive
*offset)
*offset
&work_debug_descr);
@pool
worklist
*worker
attrs
mutex_lock(&wq_pool_mutex);
@fmt:
turned
dev_to_wq(dev);
pretty
*gc
irq_data_get_irq_chip_data(d);
removed.
cell
supports
@domain
oldfs;
oldfs
set_fs(oldfs);
rmtp
options,
read.
comm);
trace_buffer_struct
=>
(l
"%u\n",
trace_option_dentry
PAGE_MASK;
ops);
@timeout:
TASK_INTERRUPTIBLE,
<linux/jiffies.h>
suspended
classes
CONFIG_LOCK_STAT
CONFIG_DEBUG_LOCKDEP
LOCKDEP_STATE(__STATE)
"lockdep_states.h"
LOCKDEP_STATE
circular_queue
data))
*hlock,
(unlikely(!debug_locks))
prev_hlock
(!debug_locks_off())
(!rb)
*base;
(value
ACCT_VERSION
raw_spin_lock(&ctx->lock);
__get_cpu_context(ctx);
*pmu
ctxn,
*hwc
*vma,
err_context;
child,
FUTEX_WAITERS
hb2);
do_for_each_ftrace_op(op,
multiplier
@desc:
irq_put_desc_unlock(desc,
unmask
*cur
tick_broadcast_device.evtdev;
bc
kstat_incr_irqs_this_cpu(irq,
@cp:
@ss:
ss);
init_css_set
&cgrp_dfl_root)
ssid);
@root
subtree
->css_online()
non-empty
length);
Elf_Sym
*size
symbol.
mmput(mm);
*cs;
%14s
(!data)
td->event
&rttest_event);
CONFIG_PRINTK
*lenp
@ppos:
from/to
put_user(0,
write_lock_irq(&tasklist_lock);
pgrp
ptracee
*sp,
trace->reset(tr);
..");
uncompressed
compression
(thr
header,
@alarm:
vec
jprobe
(!file)
__OLD_UTS_LEN);
arg5)
arg2);
kdb_machreg_fmt
kdb_symtab_t
kexec
log_next_seq)
msg_print_text(msg,
mutex_lock(&clocksource_mutex);
mutex_unlock(&clocksource_mutex);
mapkey
iter->cpu_buffer;
pr_warn("Could
&ctx->names_list,
context->type
time_state
calibration
ftbl);
f->fn
kexec_segment
*image)
mstart
mchunk;
#F,
%Ld.%06ld\n",
*word
*oldval,
(res->start
kdb_printf("due
map_info
uid_gid_map
projid
1992,
Torvalds,
probing
raw_spin_lock_irq(&desc->lock);
chips
msleep(100);
Scan
synchronize_rcu()
Undo
positives
bottom
Simple
RCU-tasks
WARN_ON(signal_pending(current));
path,
synchronize_srcu()
local_bh_enable();
flavor
*r)
definitions.
reporting
Silicon
Graphics,
(KDB_FLAG(CMD_INTERRUPT))
nextarg
Rafael
<linux/ktime.h>
smallest
unsafe
"safe"
Data
recently
linear
Link
list_for_each_entry(node,
ranges
gfp_mask);
@bm
touch_softlockup_watchdog();
(to
PAGE_SHIFT)
needed,
approximately
approach
From
Hibernation
(handle->cur
handle->cur
entirely
<linux/cgroup.h>
0),
css;
*tset)
propagate
css_task_iter_end(&it);
behind
interface.
level)
resched
Name
*isidle,
isidle,
among
combined
callback,
tracepoints
system_state
@nb:
handler;
available,
logical
cpumask_of(cpu));
meaning
way.
1991,
<linux/binfmts.h>
<asm/unistd.h>
thread,
locking.
STOP
pending,
Flush
signal,
priv
signr;
need_resched
handling.
SIGKILL
PIDTYPE_PID);
SEND_SIG_PRIV,
back.
Both
exit_code
unconditionally
want.
accordingly
(sigsetsize
changes.
probe.
compat_pid_t,
action;
__force
act,
granularity
risk
',
quick
(ch
infinite
times.
root);
filter);
